In [1]:
import pandas as pd

In [2]:
with open('/usr/share/dict/words') as f:
    words = f.read().split('\n')

print(words[:15])

['A', 'a', 'aa', 'aal', 'aalii', 'aam', 'Aani', 'aardvark', 'aardwolf', 'Aaron', 'Aaronic', 'Aaronical', 'Aaronite', 'Aaronitic', 'Aaru']

In [3]:
letter_val = []
alphabet = [chr(x+97) for x in range(26)]
num_val = [i + 1 for i in range(len(alphabet))]
# for i in range(len(alphabet)):
#     letter_val[i] = [alphabet[i], num_val[i]]
# letter_val
alphabet.index('b')

1

In [4]:
letter_val = pd.DataFrame({'letter': alphabet, 'value': num_val})

In [5]:
letter_val

   letter  value
0       a      1
1       b      2
2       c      3
3       d      4
4       e      5
5       f      6
6       g      7
7       h      8
8       i      9
9       j     10
10      k     11
11      l     12
12      m     13
13      n     14
14      o     15
15      p     16
16      q     17
17      r     18
18      s     19
19      t     20
20      u     21
21      v     22
22      w     23
23      x     24
24      y     25
25      z     26

In [6]:
hyphen = pd.DataFrame({'letter': ['-'],
                     'value': [0]})
letter_val.append(hyphen, ignore_index=True)

   letter  value
0       a      1
1       b      2
2       c      3
3       d      4
4       e      5
5       f      6
6       g      7
7       h      8
8       i      9
9       j     10
10      k     11
11      l     12
12      m     13
13      n     14
14      o     15
15      p     16
16      q     17
17      r     18
18      s     19
19      t     20
20      u     21
21      v     22
22      w     23
23      x     24
24      y     25
25      z     26
26      -      0

In [7]:
def count_first_letters(word):
    word = word.lower()
    first = num_val[alphabet.index(word[0])]
    total = 0
    for letter in word:
        total += num_val[alphabet.index(letter)]
    total -= first
    if total == first:
        print(f'{word.capitalize()} has a count of {first} for ' +
            f'the first and {total} for the remaining')
    else:
        pass

In [8]:
five_len_words = [word.lower() for word in words if len(word) == 5]
print(five_len_words[:15])

['aalii', 'aaron', 'abaca', 'aback', 'abaff', 'abaft', 'abama', 'abase', 'abash', 'abask', 'abate', 'abave', 'abaze', 'abbas', 'abbey']

In [9]:
for word in five_len_words:
    count_first_letters(word)

Raffe has a count of 18 for the first and 18 for the remaining
Sadie has a count of 19 for the first and 19 for the remaining
Sifac has a count of 19 for the first and 19 for the remaining
Table has a count of 20 for the first and 20 for the remaining
Uchee has a count of 21 for the first and 21 for the remaining
Vakia has a count of 22 for the first and 22 for the remaining
Vicia has a count of 22 for the first and 22 for the remaining
Wanga has a count of 23 for the first and 23 for the remaining
Whack has a count of 23 for the first and 23 for the remaining
Xicak has a count of 24 for the first and 24 for the remaining
Yeara has a count of 25 for the first and 25 for the remaining
Zebra has a count of 26 for the first and 26 for the remaining

In [10]:
triangle_numbers = [int((n*(n+1))/2) for n in range(100)]

In [15]:
def count_triangle_letters(word):
    my_word = word.lower()
    total = 0
    for letter in my_word:
        if letter in alphabet:
            total += num_val[alphabet.index(letter)]
    if total in triangle_numbers:
        return word, total
    else:
        pass

In [16]:
triangle_word_list = [count_triangle_letters(word) 
                      for word in words 
                      if count_triangle_letters(word) != None]

In [14]:
len(triangle_word_list)

16427

In [18]:
triangle_word_frame = pd.DataFrame(triangle_word_list)

In [19]:
triangle_word_frame

                0    1
0               A    1
1               a    1
2             aam   15
3              Ab    3
4          Ababua   28
...           ...  ...
16422  zygosporic  153
16423     zygotic  105
16424     zymogen  105
16425   zymophyte  153
16426                0

[16427 rows x 2 columns]